PROCESS.org
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="org.css"/>

* Introduction
  This is where I'm going to document the process I went through while completing
  this assignment. This document is more "stream-of-conciousness" than what one
  might normally think of as "documentation", but I'm a big believer in showing
  your work. The idea is that if you look at my code and think "What did he mean by
  this?", you don't have too look much farther than here.

* First Steps
  The first step was to put this in a directory under version control. One could argue
  about the necessity of this step for a simple assignment, but why lose history
  when you don't have to?
  
  #+BEGIN_SRC sh
    $ mkdir darkhorse-homework && cd darkhorse-homework
    $ cp ~/Downloads/sort-problem.py .
    $ git init
    $ git add * && git commit -m "Initial Commit"
  #+END_SRC

* Bug fixes
  Now, let's run it just to see what we get:
  
  #+BEGIN_SRC sh
  $ python sort-problem.py
      File "sort-problem.py", line 20
        i++
          ^
    SyntaxError: invalid syntax
  #+END_SRC

  Alright, something we can fix right off the bat, Python doesn't have this sort
  of increment operator, so let's change those ~i++~ to ~i += 1~.
  
  #+BEGIN_SRC sh
  $ python sort-problem.py
      Traceback (most recent call last):
        File "sort-problem.py", line 18, in <module>
          print("2 Sisters was at index {} before sorting".format(index))
    NameError: name 'index' is not defined
  #+END_SRC
  Looking at the source: 

  #+BEGIN_SRC python
    i = 0
    for unsorted_brand in parsed_brands:
        if unsorted_brand['name'] == '2 Sisters':
            print("2 Sisters was at index {} before sorting".format(index))
            break
        i += 1
  #+END_SRC

  
  Looks like we're referencing ~index~ on line 18 when we should probably be
  trying to print ~i~ here. However, we don't need to be doing the index book
  keeping by ourselves, so we'll ~enumerate()~ this for loop, and we'll do the
  same for the sorted loop since I see we have a similar issue there.

  #+BEGIN_SRC python
    for index, unsorted_brand in enumerate(parsed_brands):
        if unsorted_brand['name'] == '2 Sisters':
            print("2 Sisters was at index {} before sorting".format(index))
            break
  #+END_SRC

  Let's try that out...
  
  #+BEGIN_SRC sh
  $ python sort-problem.py
    2 Sisters was at index 0 before sorting
    2 Sisters was at index 2 after sorting
  #+END_SRC
  
  Okay, now we've got it working at least.


* File Clean-up
  The next step for me was to move off that giant json blob to a different file.
  Having it in with the code is a) distracting, b) annoying to try to scroll
  through in Emacs since it's all on the same line, and c) mixing data with code.
  
  So, I've moved it off to a file called ~brands.json~, which means a function
  to parse the brands in from a file, ~parse_brands~. 
  
  #+BEGIN_SRC python
  def parse_brands(filename):
      """Parses in a list of brands from a json file"""
      with open(filename, 'r') as infile:
          return json.loads(infile.read())
  #+END_SRC

  Next up, we've got some duplication going on in these pre- and post-sorting 
  checks where we find the index of '2 Sisters'. Let's split this duplication off
  to its own function, ~find_brand_by_name~. We can also abstract
  finding the index and the message we print off to another function,
  ~print_brand_position~.
  
  #+BEGIN_SRC python
  def find_brand_by_name(brands, name):
      """
      Loops through a list of brands to find the index of the brand
      whose name matches the name parameter
      """
      for index, brand in enumerate(brands):
          if brand['name'] == name:
              return index
          
  def print_brand_position(brands, name, when):
      """Finds and prints the index of a brand in the list of brands by name"""
      index = find_brand_by_name(brands, name)
      print("{0} was at index {1} {2} sorting".format(name, index, when))

  #+END_SRC
  
  I've also taken the opportunity to rename ~parsed_brands~ to just ~brands~. I
  don't think doing so loses too much information, there aren't any other sources
  of brands in this example.

