PROCESS.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>PROCESS</title>
<!-- 2017-10-23 Mon 02:30 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<link rel="stylesheet" type="text/css" href="org.css"/>
</head>
<body>
<div id="content">
<h1 class="title">PROCESS</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Introduction</a></li>
<li><a href="#sec-2">2. First Steps</a></li>
<li><a href="#sec-3">3. Bug fixes</a></li>
<li><a href="#sec-4">4. File Clean-up</a></li>
<li><a href="#sec-5">5. Algorithm Cleanup</a></li>
<li><a href="#sec-6">6. New Code</a></li>
<li><a href="#sec-7">7. Step back and smell the code</a></li>
<li><a href="#sec-8">8. Not Leaving it There</a></li>
<li><a href="#sec-9">9. Reflection</a></li>
<li><a href="#sec-10">10. Conclusion</a></li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
This is where I'm going to document the process I went through while completing
this assignment. This document is more "stream-of-conciousness" than what one
might normally think of as "documentation", but I'm a big believer in showing
your work. The idea is that if you look at my code and think "What did he mean by
this?", you don't have too look much farther than here.
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> First Steps</h2>
<div class="outline-text-2" id="text-2">
<p>
The first step was to put this in a directory under version control. One could argue
about the necessity of this step for a simple assignment, but why lose history
when you don't have to?
</p>

<div class="org-src-container">

<pre class="src src-sh">$ mkdir darkhorse-homework &amp;&amp; <span class="org-builtin">cd</span> darkhorse-homework
$ cp ~/Downloads/sort-problem.py .
$ git init
$ git add * &amp;&amp; git commit -m <span class="org-string">"Initial Commit"</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Bug fixes</h2>
<div class="outline-text-2" id="text-3">
<p>
Now, let's run it just to see what we get:
</p>

<div class="org-src-container">

<pre class="src src-sh">$ python sort-problem.py
    File <span class="org-string">"sort-problem.py"</span>, line 20
      i++
        ^
  SyntaxError: invalid syntax
</pre>
</div>

<p>
Alright, something we can fix right off the bat, Python doesn't have this sort
of increment operator, so let's change those <code>i++</code> to <code>i += 1</code>.
</p>

<div class="org-src-container">

<pre class="src src-sh">$ python sort-problem.py
    Traceback (most recent call last):
      File <span class="org-string">"sort-problem.py"</span>, line 18,<span class="org-keyword"> in</span> &lt;module&gt;
        print(<span class="org-string">"2 Sisters was at index {} before sorting"</span>.format(index))
  NameError: name <span class="org-string">'index'</span> is not defined
</pre>
</div>
<p>
Looking at the source: 
</p>

<div class="org-src-container">

<pre class="src src-python"><span class="org-variable-name">i</span> = 0
<span class="org-keyword">for</span> unsorted_brand <span class="org-keyword">in</span> parsed_brands:
    <span class="org-keyword">if</span> unsorted_brand[<span class="org-string">'name'</span>] == <span class="org-string">'2 Sisters'</span>:
        <span class="org-keyword">print</span>(<span class="org-string">"2 Sisters was at index {} before sorting"</span>.<span class="org-builtin">format</span>(index))
        <span class="org-keyword">break</span>
    <span class="org-variable-name">i</span> += 1
</pre>
</div>


<p>
Looks like we're referencing <code>index</code> on line 18 when we should probably be
trying to print <code>i</code> here. However, we don't need to be doing the index book
keeping by ourselves, so we'll <code>enumerate()</code> this for loop, and we'll do the
same for the sorted loop since I see we have a similar issue there.
</p>

<div class="org-src-container">

<pre class="src src-python"><span class="org-keyword">for</span> index, unsorted_brand <span class="org-keyword">in</span> <span class="org-builtin">enumerate</span>(parsed_brands):
    <span class="org-keyword">if</span> unsorted_brand[<span class="org-string">'name'</span>] == <span class="org-string">'2 Sisters'</span>:
        <span class="org-keyword">print</span>(<span class="org-string">"2 Sisters was at index {} before sorting"</span>.<span class="org-builtin">format</span>(index))
        <span class="org-keyword">break</span>
</pre>
</div>

<p>
Let's try that out&#x2026;
</p>

<div class="org-src-container">

<pre class="src src-sh">$ python sort-problem.py
  2 Sisters was at index 0 before sorting
  2 Sisters was at index 2 after sorting
</pre>
</div>

<p>
Okay, now we've got it working at least.
</p>
</div>
</div>


<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> File Clean-up</h2>
<div class="outline-text-2" id="text-4">
<p>
The next step for me was to move off that giant json blob to a different file.
Having it in with the code is a) distracting, b) annoying to try to scroll
through in Emacs since it's all on the same line, and c) mixing data with code.
</p>

<p>
So, I've moved it off to a file called <code>brands.json</code>, which means a function
to parse the brands in from a file, <code>parse_brands</code>. 
</p>

<div class="org-src-container">

<pre class="src src-python"><span class="org-keyword">def</span> <span class="org-function-name">parse_brands</span>(filename):
    <span class="org-doc">"""Parses in a list of brands from a json file"""</span>
    <span class="org-keyword">with</span> <span class="org-builtin">open</span>(filename, <span class="org-string">'r'</span>) <span class="org-keyword">as</span> infile:
        <span class="org-keyword">return</span> json.loads(infile.read())
</pre>
</div>

<p>
Next up, we've got some duplication going on in these pre- and post-sorting 
checks where we find the index of '2 Sisters'. Let's split this duplication off
to its own function, <code>find_brand_by_name</code>. We can also abstract
finding the index and the message we print off to another function,
<code>print_brand_position</code>.
</p>

<div class="org-src-container">

<pre class="src src-python"><span class="org-keyword">def</span> <span class="org-function-name">find_brand_by_name</span>(brands, name):
    <span class="org-doc">"""</span>
<span class="org-doc">    Loops through a list of brands to find the index of the brand</span>
<span class="org-doc">    whose name matches the name parameter</span>
<span class="org-doc">    """</span>
    <span class="org-keyword">for</span> index, brand <span class="org-keyword">in</span> <span class="org-builtin">enumerate</span>(brands):
        <span class="org-keyword">if</span> brand[<span class="org-string">'name'</span>] == name:
            <span class="org-keyword">return</span> index

<span class="org-keyword">def</span> <span class="org-function-name">print_brand_position</span>(brands, name, when):
    <span class="org-doc">"""Finds and prints the index of a brand in the list of brands by name"""</span>
    <span class="org-variable-name">index</span> = find_brand_by_name(brands, name)
    <span class="org-keyword">print</span>(<span class="org-string">"{0} was at index {1} {2} sorting"</span>.<span class="org-builtin">format</span>(name, index, when))
</pre>
</div>

<p>
I've also taken the opportunity to rename <code>parsed_brands</code> to just <code>brands</code>. I
don't think doing so loses too much information, there aren't any other sources
of brands in this example.
</p>
</div>
</div>
