PROCESS.org
* Algorithm Cleanup
  Okay, let's take a crack at the actual sorting part. I'm going to paste that part
  here and figure out what's going on.
  
  #+BEGIN_SRC python
  count = 0
  while count < len(brands):
      for index, brand in enumerate(brands):
          if index < len(brands) - 1:
              if brands[index]['uuid'] > brands[index+1]['uuid']:
                  temp = brands[index+1]
                  brands[index+1] = brands[index]
                  brands[index] = temp
          count += 1
  #+END_SRC
  
  Bird's eye view, we're doing (or trying to do) an in-place bubble sort. Every
  iteration of the while loop we iterate over the brands and swap brands in-place
  based on their uuids. However, we have an indentation bug here. ~count~ is
  incremented inside of the for loop, which means it will count up to
  ~len(parsed_brands)~ during the first iteration of the while loop, terminating it
  after only one iteration through the brands list. That first iteration is enough
  to get 2 Sisters to the position we expect it to be, but it leaves these two
  unsorted:

  3 Story (uuid 288122ef4fab411692dbd14c39370056)

  300 (uuid 190bd25802f54732a8907adb591d3094)
  
  In other words, so far it's only been working by accident. Again, it begs the
  question, why are we doing this loop bookkeeping ourselves? We could fix up this
  section by doing some clean ups:
  
  #+BEGIN_SRC python
  unsorted = True
  while unsorted:
      for i in range(len(brands) - 1):
          unsorted = False
          if brands[i]['uuid'] > brands[i+1]['uuid']:
              unsorted = True
              brands[i+1], brands[i] = brands[i], brands[i+1]
  #+END_SRC
  
  This gives us the more canonical version of bubble sort, while also getting
  rid of that ~temp~ variable using tuple assignment.
  
  Now, we can wrap this up in a function and get on to the next step, but I
  question why we're implementing our own sorting function. Python's ~list.sort~
  would do the trick just as well - it's more flexible because it'll be less
  work to start sorting by other properties and it's less code that we have to
  maintain.
  
  #+BEGIN_SRC python
  brands.sort(key=lambda brand: brand['uuid'])
  #+END_SRC
  
  There, I think that's about as simple as we're going to get it. Let's move on to
  the new code portion of the assignment.

* New Code
  The objective here is to return a list of all the individual books sorted by 
  release date. A simple list comprehension and another call to ~list.sort~
  should work pretty nicely here. We'll also write a little something to print
  to console:
  
  #+BEGIN_SRC python
  def get_books_from_brands(brands):
      return [book for brand in brands
              for series in brand['series']
              for volume in series['volumes']
              for book in volume['books']]

  books = get_books_from_brands(brands)
  books.sort(key=lambda b: b['release_date'])

  for book in books:
      print("{0} was released {1}".format(book['title'], book['release_date']))
  #+END_SRC
  
  Let's test it out:
  
  #+BEGIN_SRC sh
  $ python sort-problem.py
  2 Sisters was at index 0 before sorting
  2 Sisters was at index 2 after sorting

  3 Story: The Secret History of the Giant Man was released 2012-04-04 00:00:00
  3 Story: Secret Files of the Giant Man One-Shot was released 2012-04-18 00:00:00
  300 was released 2012-05-16 00:00:00
  47 Ronin #1 was released 2012-11-07 00:00:00
  47 Ronin #2 was released 2013-01-02 00:00:00
  365 Samurai and a Few Bowls of Rice was released 2013-01-16 00:00:00
  47 Ronin #3 was released 2013-03-06 00:00:00
  47 Ronin #4 was released 2013-05-01 00:00:00
  47 Ronin #5 was released 2013-07-03 00:00:00
  47 Ronin #1-#5 Bundle was released 2013-07-31 00:00:00
  2 Sisters: A Super-Spy Graphic Novel was released 2015-09-30 00:00:00
  #+END_SRC
  
  
  Pefect!

