PROCESS.html

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Algorithm Cleanup</h2>
<div class="outline-text-2" id="text-5">
<p>
Okay, let's take a crack at the actual sorting part. I'm going to paste that part
here and figure out what's going on.
</p>

<div class="org-src-container">

<pre class="src src-python"><span class="org-variable-name">count</span> = 0
<span class="org-keyword">while</span> count &lt; <span class="org-builtin">len</span>(brands):
    <span class="org-keyword">for</span> index, brand <span class="org-keyword">in</span> <span class="org-builtin">enumerate</span>(brands):
        <span class="org-keyword">if</span> index &lt; <span class="org-builtin">len</span>(brands) - 1:
            <span class="org-keyword">if</span> brands[index][<span class="org-string">'uuid'</span>] &gt; brands[index+1][<span class="org-string">'uuid'</span>]:
                <span class="org-variable-name">temp</span> = brands[index+1]
                <span class="org-variable-name">brands</span>[index+1] = brands[index]
                <span class="org-variable-name">brands</span>[index] = temp
        <span class="org-variable-name">count</span> += 1
</pre>
</div>

<p>
Bird's eye view, we're doing (or trying to do) an in-place bubble sort. Every
iteration of the while loop we iterate over the brands and swap brands in-place
based on their uuids. However, we have an indentation bug here. <code>count</code> is
incremented inside of the for loop, which means it will count up to
<code>len(parsed_brands)</code> during the first iteration of the while loop, terminating it
after only one iteration through the brands list. That first iteration is enough
to get 2 Sisters to the position we expect it to be, but it leaves these two
unsorted:
</p>

<p>
3 Story (uuid 288122ef4fab411692dbd14c39370056)
</p>

<p>
300 (uuid 190bd25802f54732a8907adb591d3094)
</p>

<p>
In other words, so far it's only been working by accident. Again, it begs the
question, why are we doing this loop bookkeeping ourselves? We could fix up this
section by doing some clean ups:
</p>

<div class="org-src-container">

<pre class="src src-python"><span class="org-variable-name">unsorted</span> = <span class="org-constant">True</span>
<span class="org-keyword">while</span> unsorted:
    <span class="org-keyword">for</span> i <span class="org-keyword">in</span> <span class="org-builtin">range</span>(<span class="org-builtin">len</span>(brands) - 1):
        <span class="org-variable-name">unsorted</span> = <span class="org-constant">False</span>
        <span class="org-keyword">if</span> brands[i][<span class="org-string">'uuid'</span>] &gt; brands[i+1][<span class="org-string">'uuid'</span>]:
            <span class="org-variable-name">unsorted</span> = <span class="org-constant">True</span>
            brands[i+1], <span class="org-variable-name">brands</span>[i] = brands[i], brands[i+1]
</pre>
</div>

<p>
This gives us the more canonical version of bubble sort, while also getting
rid of that <code>temp</code> variable using tuple assignment.
</p>

<p>
Now, we can wrap this up in a function and get on to the next step, but I
question why we're implementing our own sorting function. Python's <code>list.sort</code>
would do the trick just as well - it's more flexible because it'll be less
work to start sorting by other properties and it's less code that we have to
maintain.
</p>

<div class="org-src-container">

<pre class="src src-python">brands.sort(key=<span class="org-keyword">lambda</span> brand: brand[<span class="org-string">'uuid'</span>])
</pre>
</div>

<p>
There, I think that's about as simple as we're going to get it. Let's move on to
the new code portion of the assignment.
</p>
</div>
</div>

<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> New Code</h2>
<div class="outline-text-2" id="text-6">
<p>
The objective here is to return a list of all the individual books sorted by 
release date. A simple list comprehension and another call to <code>list.sort</code>
should work pretty nicely here. We'll also write a little something to print
to console:
</p>

<div class="org-src-container">

<pre class="src src-python"><span class="org-keyword">def</span> <span class="org-function-name">get_books_from_brands</span>(brands):
    <span class="org-keyword">return</span> [book <span class="org-keyword">for</span> brand <span class="org-keyword">in</span> brands
            <span class="org-keyword">for</span> series <span class="org-keyword">in</span> brand[<span class="org-string">'series'</span>]
            <span class="org-keyword">for</span> volume <span class="org-keyword">in</span> series[<span class="org-string">'volumes'</span>]
            <span class="org-keyword">for</span> book <span class="org-keyword">in</span> volume[<span class="org-string">'books'</span>]]

<span class="org-variable-name">books</span> = get_books_from_brands(brands)
books.sort(key=<span class="org-keyword">lambda</span> b: b[<span class="org-string">'release_date'</span>])

<span class="org-keyword">for</span> book <span class="org-keyword">in</span> books:
    <span class="org-keyword">print</span>(<span class="org-string">"{0} was released {1}"</span>.<span class="org-builtin">format</span>(book[<span class="org-string">'title'</span>], book[<span class="org-string">'release_date'</span>]))
</pre>
</div>

<p>
Let's test it out:
</p>

<div class="org-src-container">

<pre class="src src-sh">$ python sort-problem.py
2 Sisters was at index 0 before sorting
2 Sisters was at index 2 after sorting

3 Story: The Secret History of the Giant Man was released 2012-04-04 00:00:00
3 Story: Secret Files of the Giant Man One-Shot was released 2012-04-18 00:00:00
300 was released 2012-05-16 00:00:00
47 Ronin <span class="org-comment-delimiter">#</span><span class="org-comment">1 was released 2012-11-07 00:00:00</span>
47 Ronin <span class="org-comment-delimiter">#</span><span class="org-comment">2 was released 2013-01-02 00:00:00</span>
365 Samurai and a Few Bowls of Rice was released 2013-01-16 00:00:00
47 Ronin <span class="org-comment-delimiter">#</span><span class="org-comment">3 was released 2013-03-06 00:00:00</span>
47 Ronin <span class="org-comment-delimiter">#</span><span class="org-comment">4 was released 2013-05-01 00:00:00</span>
47 Ronin <span class="org-comment-delimiter">#</span><span class="org-comment">5 was released 2013-07-03 00:00:00</span>
47 Ronin <span class="org-comment-delimiter">#</span><span class="org-comment">1-#5 Bundle was released 2013-07-31 00:00:00</span>
2 Sisters: A Super-Spy Graphic Novel was released 2015-09-30 00:00:00
</pre>
</div>


<p>
Pefect!
</p>
</div>
</div>
