PROCESS.org
* Step back and smell the code
  I believe this is as simple as the code is going to get at this point.
  I'll actually put the whole file (less assignment context strings) here in its
  entirety:
  
  #+BEGIN_SRC python
  import json

  def parse_brands(filename):
      """Parses in a list of brands from a json file"""
      with open(filename, 'r') as infile:
          return json.loads(infile.read())

  def find_brand_by_name(brands, name):
      """
      Loops through a list of brands to find the index of the brand
      whose name matches the name parameter
      """
      for index, brand in enumerate(brands):
          if brand['name'] == name:
              return index
          
  def print_brand_position(brands, name, when):
      """Finds and prints the index of a brand in the list of brands by name"""
      index = find_brand_by_name(brands, name)
      print("{0} was at index {1} {2} sorting".format(name, index, when))

  def get_books_from_brands(brands):
        return [book for brand in brands
                for series in brand['series']
                for volume in series['volumes']
                for book in volume['books']]

  brands = parse_brands('brands.json')

  print_brand_position(brands, name='2 Sisters', when='before')

  brands.sort(key=lambda brand: brand['uuid'])

  print_brand_position(brands, name='2 Sisters', when='after')

  books = get_books_from_brands(brands)
  books.sort(key=lambda b: b['release_date'])

  for book in books:
      print("{0} was released {1}".format(book['title'], book['release_date']))
  #+END_SRC
  
  We've gone from having a massive blob of json right on top, with our own
  broken bubble sort implementation and a couple of syntax errors for good
  measure, to simple script that would be trivial for anybody to pick it up and
  grasp it easily. If this /were/ a just simple script, I would probably leave
  it here.


