PROCESS.html

<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> Step back and smell the code</h2>
<div class="outline-text-2" id="text-7">
<p>
I believe this is as simple as the code is going to get at this point.
I'll actually put the whole file (less assignment context strings) here in its
entirety:
</p>

<div class="org-src-container">

<pre class="src src-python"><span class="org-keyword">import</span> json

<span class="org-keyword">def</span> <span class="org-function-name">parse_brands</span>(filename):
    <span class="org-doc">"""Parses in a list of brands from a json file"""</span>
    <span class="org-keyword">with</span> <span class="org-builtin">open</span>(filename, <span class="org-string">'r'</span>) <span class="org-keyword">as</span> infile:
        <span class="org-keyword">return</span> json.loads(infile.read())

<span class="org-keyword">def</span> <span class="org-function-name">find_brand_by_name</span>(brands, name):
    <span class="org-doc">"""</span>
<span class="org-doc">    Loops through a list of brands to find the index of the brand</span>
<span class="org-doc">    whose name matches the name parameter</span>
<span class="org-doc">    """</span>
    <span class="org-keyword">for</span> index, brand <span class="org-keyword">in</span> <span class="org-builtin">enumerate</span>(brands):
        <span class="org-keyword">if</span> brand[<span class="org-string">'name'</span>] == name:
            <span class="org-keyword">return</span> index

<span class="org-keyword">def</span> <span class="org-function-name">print_brand_position</span>(brands, name, when):
    <span class="org-doc">"""Finds and prints the index of a brand in the list of brands by name"""</span>
    <span class="org-variable-name">index</span> = find_brand_by_name(brands, name)
    <span class="org-keyword">print</span>(<span class="org-string">"{0} was at index {1} {2} sorting"</span>.<span class="org-builtin">format</span>(name, index, when))

<span class="org-keyword">def</span> <span class="org-function-name">get_books_from_brands</span>(brands):
      <span class="org-keyword">return</span> [book <span class="org-keyword">for</span> brand <span class="org-keyword">in</span> brands
              <span class="org-keyword">for</span> series <span class="org-keyword">in</span> brand[<span class="org-string">'series'</span>]
              <span class="org-keyword">for</span> volume <span class="org-keyword">in</span> series[<span class="org-string">'volumes'</span>]
              <span class="org-keyword">for</span> book <span class="org-keyword">in</span> volume[<span class="org-string">'books'</span>]]

<span class="org-variable-name">brands</span> = parse_brands(<span class="org-string">'brands.json'</span>)

print_brand_position(brands, name=<span class="org-string">'2 Sisters'</span>, when=<span class="org-string">'before'</span>)

brands.sort(key=<span class="org-keyword">lambda</span> brand: brand[<span class="org-string">'uuid'</span>])

print_brand_position(brands, name=<span class="org-string">'2 Sisters'</span>, when=<span class="org-string">'after'</span>)

<span class="org-variable-name">books</span> = get_books_from_brands(brands)
books.sort(key=<span class="org-keyword">lambda</span> b: b[<span class="org-string">'release_date'</span>])

<span class="org-keyword">for</span> book <span class="org-keyword">in</span> books:
    <span class="org-keyword">print</span>(<span class="org-string">"{0} was released {1}"</span>.<span class="org-builtin">format</span>(book[<span class="org-string">'title'</span>], book[<span class="org-string">'release_date'</span>]))
</pre>
</div>

<p>
We've gone from having a massive blob of json right on top, with our own
broken bubble sort implementation and a couple of syntax errors for good
measure, to simple script that would be trivial for anybody to pick it up and
grasp it easily. If this <i>were</i> a just simple script, I would probably leave
it here.
</p>
</div>
</div>
