PROCESS.org
* Not Leaving it There
  Without the benefit of a greater application context for this script to fit into,
  it would be difficult to say what would be needed to make this as maintainable as
  possible, or where to draw the line for how much abstraction would be too much.
  
  For instance, we might begin writing some classes to model our data and replace
  some of these top-level functions with methods. I put these classes in a separate
  file - ~models.py~, and they're fairly bog-standard classes. I opted to use a 
  ~**kwargs~ constructor along with a dictionary in the constructor to provide sane
  defaults. I also implemented some ~@staticmethod~ methods that take a ~json_map~
  and returns a new instance. This lets us be a little more flexible if the JSON
  schema changes, and it makes writing our specialized decoder class, ~BrandDecoder~,
  a little more clean, as you can see below.
  
  #+BEGIN_SRC python
  class Brand:    
      def __init__(self, **kwargs):
          defaults = {
              'is_featured': False,
              'name': '',
              'badge_image_url': '',
              'sort_key': '',
              'series': [],
              'cover_image': '',
              'etag': '',
              'uuid': ''
          }
          for prop, default in defaults.items():
              setattr(self, prop, kwargs.get(prop, default))

      # <snip>
      @staticmethod
      def decode(json_map):
          return Brand(**json_map)

  class BrandDecoder(json.JSONDecoder):
      def __init__(self, *args, **kwargs):
          json.JSONDecoder.__init__(self, object_hook=self.object_hook,
                                    ,*args, **kwargs)

      def object_hook(self, obj):
          if 'series' in obj:
              return Brand.decode(obj)
          elif 'volumes' in obj:
              return Series.decode(obj)
          elif 'books' in obj:
              return Volume.decode(obj)
          elif 'book_uuid' in obj:
              return Book.decode(obj)
          else:
              return obj
  #+END_SRC
  
  This is going to let us parse our JSON into a list of ~Brand~ and similar with
  minimal fuss, in fact all we have to do is rewrite our ~parse_brands~ function
  like so:
  
  #+BEGIN_SRC python
  import json

  from models import BrandDecoder

  def parse_brands(filename):
      """Parses in a list of brands from a json file"""
      with open(filename, 'r') as infile:
          return json.loads(infile.read(), cls=BrandDecoder)
  #+END_SRC
  
  Just import the decoder and pass it in as a kwarg to ~json.loads~. We can also
  drop the ~get_books_from_brands~ function now, we'll just add a few ~@property~
  methods to the ~Brand~ and ~Series~ classes:
  
  #+BEGIN_SRC python
  class Brand:
      def __init__(self, **kwargs):
          # <snip>

      @property
      def volumes(self):
          return [volume for series in self.series for volume in series.volumes]

      @property
      def books:
          return [book for series in self.series for book in series.books]

  class Series:
      def __init__(self, **kwargs):
          # <snip>

      @property
      def books:
          return [book for volume in self.volumes for book in volume.books]
  #+END_SRC
  
  And now
  #+BEGIN_SRC python
  books = get_books_from_brands(brands)
  #+END_SRC
  
  becomes
  #+BEGIN_SRC python
  books = [book for brand in brands for book in brand.books]
  #+END_SRC

* Reflection
  Is this necessarily better? We could keep the ~get_books_from_brands~ function
  and just rewrite the inner list comprehension to be shorter. I could go either
  way on this one. On the one hand, naming things explicitly is good, and it would
  be nice to not have to rewrite the comprehension every time. On the other hand,
  if we wrote a function for every one-liner comprehension we'd soon be littered 
  with many functions that do similar things and differ only slightly. 
  
  In a similar way, we could replace ~find_brand_by_name~ in ~print_brand_position~
  with a generator expression and a call to ~next()~
  
  #+BEGIN_SRC python
  def print_brand_position(brands, name, when):
      #index = find_brand_by_name(brands, name)
      index = next(i for i, brands in enumerate(brands) if brand.name == name)
      print("{0} was at index {1} {2} sorting".format(name, index, when))
  #+END_SRC
  
  I think this example falls on the other side of the line, here the naming of
  ~find_brand_by_name~ is more useful than looking at this newer line. While
  compact, every time you come back to this function after a while you'll need to
  re-parse this expression, whereas naming it with a function allows you to grok
  what's happening just a little faster. In fact, by rewriting ~find_brand_by_name~
  using this line instead of the for loop it was using before allows us to rewrite
  the docstring to be a blow-by-blow English version of the line:
  
  #+BEGIN_SRC python
    def find_brand_by_name(brands, name):
        """
        Returns the index of the first brand in a list of brands
        whose name matches name
        """
        return next(i for i, brands in enumerate(brands) if brand.name == name)
  #+END_SRC

