PROCESS.html


<div id="outline-container-sec-8" class="outline-2">
<h2 id="sec-8"><span class="section-number-2">8</span> Not Leaving it There</h2>
<div class="outline-text-2" id="text-8">
<p>
Without the benefit of a greater application context for this script to fit into,
it would be difficult to say what would be needed to make this as maintainable as
possible, or where to draw the line for how much abstraction would be too much.
</p>

<p>
For instance, we might begin writing some classes to model our data and replace
some of these top-level functions with methods. I put these classes in a separate
file - <code>models.py</code>, and they're fairly bog-standard classes. I opted to use a 
<code>**kwargs</code> constructor along with a dictionary in the constructor to provide sane
defaults. I also implemented some <code>@staticmethod</code> methods that take a <code>json_map</code>
and returns a new instance. This lets us be a little more flexible if the JSON
schema changes, and it makes writing our specialized decoder class, <code>BrandDecoder</code>,
a little more clean, as you can see below.
</p>

<div class="org-src-container">

<pre class="src src-python"><span class="org-keyword">class</span> <span class="org-type">Brand</span>:    
    <span class="org-keyword">def</span> <span class="org-function-name">__init__</span>(<span class="org-keyword">self</span>, **kwargs):
        <span class="org-variable-name">defaults</span> = {
            <span class="org-string">'is_featured'</span>: <span class="org-constant">False</span>,
            <span class="org-string">'name'</span>: <span class="org-string">''</span>,
            <span class="org-string">'badge_image_url'</span>: <span class="org-string">''</span>,
            <span class="org-string">'sort_key'</span>: <span class="org-string">''</span>,
            <span class="org-string">'series'</span>: [],
            <span class="org-string">'cover_image'</span>: <span class="org-string">''</span>,
            <span class="org-string">'etag'</span>: <span class="org-string">''</span>,
            <span class="org-string">'uuid'</span>: <span class="org-string">''</span>
        }
        <span class="org-keyword">for</span> prop, default <span class="org-keyword">in</span> defaults.items():
            <span class="org-builtin">setattr</span>(<span class="org-keyword">self</span>, prop, kwargs.get(prop, default))

    <span class="org-comment-delimiter"># </span><span class="org-comment">&lt;snip&gt;</span>
    <span class="org-type">@staticmethod</span>
    <span class="org-keyword">def</span> <span class="org-function-name">decode</span>(json_map):
        <span class="org-keyword">return</span> Brand(**json_map)

<span class="org-keyword">class</span> <span class="org-type">BrandDecoder</span>(json.JSONDecoder):
    <span class="org-keyword">def</span> <span class="org-function-name">__init__</span>(<span class="org-keyword">self</span>, *args, **kwargs):
        json.JSONDecoder.__init__(<span class="org-keyword">self</span>, object_hook=<span class="org-keyword">self</span>.object_hook,
                                  *args, **kwargs)

    <span class="org-keyword">def</span> <span class="org-function-name">object_hook</span>(<span class="org-keyword">self</span>, obj):
        <span class="org-keyword">if</span> <span class="org-string">'series'</span> <span class="org-keyword">in</span> obj:
            <span class="org-keyword">return</span> Brand.decode(obj)
        <span class="org-keyword">elif</span> <span class="org-string">'volumes'</span> <span class="org-keyword">in</span> obj:
            <span class="org-keyword">return</span> Series.decode(obj)
        <span class="org-keyword">elif</span> <span class="org-string">'books'</span> <span class="org-keyword">in</span> obj:
            <span class="org-keyword">return</span> Volume.decode(obj)
        <span class="org-keyword">elif</span> <span class="org-string">'book_uuid'</span> <span class="org-keyword">in</span> obj:
            <span class="org-keyword">return</span> Book.decode(obj)
        <span class="org-keyword">else</span>:
            <span class="org-keyword">return</span> obj
</pre>
</div>

<p>
This is going to let us parse our JSON into a list of <code>Brand</code> and similar with
minimal fuss, in fact all we have to do is rewrite our <code>parse_brands</code> function
like so:
</p>

<div class="org-src-container">

<pre class="src src-python"><span class="org-keyword">import</span> json

<span class="org-keyword">from</span> models <span class="org-keyword">import</span> BrandDecoder

<span class="org-keyword">def</span> <span class="org-function-name">parse_brands</span>(filename):
    <span class="org-doc">"""Parses in a list of brands from a json file"""</span>
    <span class="org-keyword">with</span> <span class="org-builtin">open</span>(filename, <span class="org-string">'r'</span>) <span class="org-keyword">as</span> infile:
        <span class="org-keyword">return</span> json.loads(infile.read(), cls=BrandDecoder)
</pre>
</div>

<p>
Just import the decoder and pass it in as a kwarg to <code>json.loads</code>. We can also
drop the <code>get_books_from_brands</code> function now, we'll just add a few <code>@property</code>
methods to the <code>Brand</code> and <code>Series</code> classes:
</p>

<div class="org-src-container">

<pre class="src src-python"><span class="org-keyword">class</span> <span class="org-type">Brand</span>:
    <span class="org-keyword">def</span> <span class="org-function-name">__init__</span>(<span class="org-keyword">self</span>, **kwargs):
        <span class="org-comment-delimiter"># </span><span class="org-comment">&lt;snip&gt;</span>

    <span class="org-type">@property</span>
    <span class="org-keyword">def</span> <span class="org-function-name">volumes</span>(<span class="org-keyword">self</span>):
        <span class="org-keyword">return</span> [volume <span class="org-keyword">for</span> series <span class="org-keyword">in</span> <span class="org-keyword">self</span>.series <span class="org-keyword">for</span> volume <span class="org-keyword">in</span> series.volumes]

    <span class="org-type">@property</span>
    <span class="org-keyword">def</span> <span class="org-function-name">books</span>:
        <span class="org-keyword">return</span> [book <span class="org-keyword">for</span> series <span class="org-keyword">in</span> <span class="org-keyword">self</span>.series <span class="org-keyword">for</span> book <span class="org-keyword">in</span> series.books]

<span class="org-keyword">class</span> <span class="org-type">Series</span>:
    <span class="org-keyword">def</span> <span class="org-function-name">__init__</span>(<span class="org-keyword">self</span>, **kwargs):
        <span class="org-comment-delimiter"># </span><span class="org-comment">&lt;snip&gt;</span>

    <span class="org-type">@property</span>
    <span class="org-keyword">def</span> <span class="org-function-name">books</span>:
        <span class="org-keyword">return</span> [book <span class="org-keyword">for</span> volume <span class="org-keyword">in</span> <span class="org-keyword">self</span>.volumes <span class="org-keyword">for</span> book <span class="org-keyword">in</span> volume.books]
</pre>
</div>

<p>
And now
</p>
<div class="org-src-container">

<pre class="src src-python"><span class="org-variable-name">books</span> = get_books_from_brands(brands)
</pre>
</div>

<p>
becomes
</p>
<div class="org-src-container">

<pre class="src src-python"><span class="org-variable-name">books</span> = [book <span class="org-keyword">for</span> brand <span class="org-keyword">in</span> brands <span class="org-keyword">for</span> book <span class="org-keyword">in</span> brand.books]
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-9" class="outline-2">
<h2 id="sec-9"><span class="section-number-2">9</span> Reflection</h2>
<div class="outline-text-2" id="text-9">
<p>
Is this necessarily better? We could keep the <code>get_books_from_brands</code> function
and just rewrite the inner list comprehension to be shorter. I could go either
way on this one. On the one hand, naming things explicitly is good, and it would
be nice to not have to rewrite the comprehension every time. On the other hand,
if we wrote a function for every one-liner comprehension we'd soon be littered 
with many functions that do similar things and differ only slightly. 
</p>

<p>
In a similar way, we could replace <code>find_brand_by_name</code> in <code>print_brand_position</code>
with a generator expression and a call to <code>next()</code>
</p>

<div class="org-src-container">

<pre class="src src-python"><span class="org-keyword">def</span> <span class="org-function-name">print_brand_position</span>(brands, name, when):
    <span class="org-comment-delimiter">#</span><span class="org-comment">index = find_brand_by_name(brands, name)</span>
    <span class="org-variable-name">index</span> = <span class="org-builtin">next</span>(i <span class="org-keyword">for</span> i, brands <span class="org-keyword">in</span> <span class="org-builtin">enumerate</span>(brands) <span class="org-keyword">if</span> brand.name == name)
    <span class="org-keyword">print</span>(<span class="org-string">"{0} was at index {1} {2} sorting"</span>.<span class="org-builtin">format</span>(name, index, when))
</pre>
</div>

<p>
I think this example falls on the other side of the line, here the naming of
<code>find_brand_by_name</code> is more useful than looking at this newer line. While
compact, every time you come back to this function after a while you'll need to
re-parse this expression, whereas naming it with a function allows you to grok
what's happening just a little faster. In fact, by rewriting <code>find_brand_by_name</code>
using this line instead of the for loop it was using before allows us to rewrite
the docstring to be a blow-by-blow English version of the line:
</p>

<div class="org-src-container">

<pre class="src src-python"><span class="org-keyword">def</span> <span class="org-function-name">find_brand_by_name</span>(brands, name):
    <span class="org-doc">"""</span>
<span class="org-doc">    Returns the index of the first brand in a list of brands</span>
<span class="org-doc">    whose name matches name</span>
<span class="org-doc">    """</span>
    <span class="org-keyword">return</span> <span class="org-builtin">next</span>(i <span class="org-keyword">for</span> i, brands <span class="org-keyword">in</span> <span class="org-builtin">enumerate</span>(brands) <span class="org-keyword">if</span> brand.name == name)
</pre>
</div>
</div>
</div>
