PROCESS.org
* Conclusion
  Is there more we could do here? Sure, there's always something you could be doing.
  Writing unit tests, implementing better error handling, writing more detailed
  documentation, the list goes on. For something as small as this script however, I
  think we've taken it as far as could be considered practical.
  
  Hopefully I did a decent job of guiding you through my thought process, I hope you
  enjoyed the journey with me, and I hope to be seeing you in person!
