PROCESS.html

<div id="outline-container-sec-10" class="outline-2">
<h2 id="sec-10"><span class="section-number-2">10</span> Conclusion</h2>
<div class="outline-text-2" id="text-10">
<p>
Is there more we could do here? Sure, there's always something you could be doing.
Writing unit tests, implementing better error handling, writing more detailed
documentation, the list goes on. For something as small as this script however, I
think we've taken it as far as could be considered practical.
</p>

<p>
Hopefully I did a decent job of guiding you through my thought process, I hope you
enjoyed the journey with me, and I hope to be seeing you in person!
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2017-10-23 Mon 02:30</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 25.3.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
